RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_spi.c
/*********************************************************************************************************//**
 * @brief Set the SPIx guard time length.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param Guard_Time: number of SCK to be the guard time length.
 *   This parameter can be: SPI_GUADTIME_1_SCK to SPI_GUADTIME_16_SCK.
 * @retval None
 ************************************************************************************************************/
void SPI_GUARDTConfig(HT_SPI_TypeDef* SPIx, u32 Guard_Time)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_GUADTIME(Guard_Time));

  SPIx->CR0 = (SPIx->CR0 & 0xF0FF) | (Guard_Time << 8);
}

/*********************************************************************************************************//**
 * @brief Set the SPIx chip select hold time.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param CS_Hold_Time: number of SCK to be the hold time length.
 *   This parameter can be: 0 ~ 15
 * @retval None
 ************************************************************************************************************/
void SPI_SELHTConfig(HT_SPI_TypeDef* SPIx, u32 CS_Hold_Time)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_SELHOLDTIME(CS_Hold_Time));

  SPIx->CR0 = (SPIx->CR0 & 0x0FFF) | (CS_Hold_Time << 12);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
